ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; WAZAMONO_TSURUGI_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define WAZAMONO_TSURUGI_PINOUT
#define WAZAMONO_BOARD_TSURUGI 1  /* Board identification macro (matches bootloader convention) */
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (Uno R3 layout, D0..D19 contiguous) ---- */
#define PIN_PA5 (0)   // D0  RX  (USART0 RX, ALT1)
#define PIN_PA4 (1)   // D1  TX  (USART0 TX, ALT1)
#define PIN_PA7 (2)   // D2  (USART0 XDIR / AC0 OUT / EVOUTA / CLKOUT)
#define PIN_PA6 (3)   // D3  ~PWM(TCB1 via CCL LUT0) / USART0 XCK
#define PIN_PC3 (4)   // D4  ~PWM(TCB1 via CCL LUT1); VDD-driven output (confirmed by measurement)
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PF4 (7)   // D7  general I/O (no PWM: TCB0 = millis)
#define PIN_PF5 (8)   // D8  general I/O (TCB1 WO parking position - see D3 PWM note)
#define PIN_PD2 (9)   // D9  TCA0 WO2
#define PIN_PD3 (10)  // D10 TCA0 WO3 / SS (Uno convention, SSD=1)
#define PIN_PD4 (11)  // D11 TCA0 WO4 / SPI MOSI
#define PIN_PD5 (12)  // D12 TCA0 WO5 / SPI MISO
#define PIN_PD6 (13)  // D13 SPI SCK / LED_BUILTIN (op-amp buffered on the board)
#define PIN_PF0 (14)  // D14 A0
#define PIN_PF1 (15)  // D15 A1
#define PIN_PF2 (16)  // D16 A2
#define PIN_PF3 (17)  // D17 A3
#define PIN_PA2 (18)  // D18 A4 / SDA
#define PIN_PA3 (19)  // D19 A5 / SCL
#define PIN_PD7 (20)  // D20/A20 = AREF (VREFA) | GPIO | SPI0 SS(ALT4) | Serial2 RX
#define PIN_PA0 (30)  // D30 TX activity LED (active-LOW; USB-CDC traffic, variant-driven)
#define PIN_PA1 (31)  // D31 RX activity LED (active-LOW; USB-CDC traffic, variant-driven)
#define PIN_PF6 (32)  // RESET
#define PIN_PF7 (33)  // UPDI  (highest index -> sets NUM_DIGITAL_PINS = 34)

/* ---- Counts ---- */
#define PINS_COUNT                     (34)  // length of the pin tables (incl. hidden gaps 21-29)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 25
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (no crystal; PA0/PA1 = TX/RX LEDs, still writable GPIO)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD6)   // D13, on-board LED (Uno convention)
#endif
/* USB-CDC activity LEDs (Pro Micro convention, both active-LOW, 3.3 V rail).
 * Driven from the CDC hooks in wazamono_tsurugi_init.cpp; sketches may also
 * digitalWrite() them - they just fight the ~100 ms activity pulses. */
#define PIN_LED_TX                     (PIN_PA0)   /* D30 */
#define PIN_LED_RX                     (PIN_PA1)   /* D31 */
#define LED_BUILTIN_TX                 PIN_LED_TX
#define LED_BUILTIN_RX                 PIN_LED_RX
/* 32U4-core compatible LED macros (Leonardo/Micro sketches): the "1" form
 * turns the LED ON, the "0" form OFF. Both LEDs are active-LOW, so ON = OUTCLR.
 * digitalWrite(D30/D31, LOW) lights the LED the same way. */
#define TXLED1                         (PORTA.OUTCLR = PIN0_bm)   /* TX LED ON  */
#define TXLED0                         (PORTA.OUTSET = PIN0_bm)   /* TX LED OFF */
#define RXLED1                         (PORTA.OUTCLR = PIN1_bm)   /* RX LED ON  */
#define RXLED0                         (PORTA.OUTSET = PIN1_bm)   /* RX LED OFF */

/* ---- Event output pins: FIXED by the board's pin-configuration table ----
 * One pin per event output, no alternatives. Libraries (CustomLogic, and the
 * Event library in its Wazamono form) route event outputs to these pins only.
 *   EVOUTA -> PA7 = D8   (PORTMUX ALT1; PA2/D18 stays I2C SDA)
 *   EVOUTD -> PD2 = D9   (PORTMUX default; the hardware offers only PD2 or
 *                         PD7, and PD7 is the AREF pin on this board)
 *   EVOUTF -> PF2 = A2   (PORTMUX default) */
#define WAZAMONO_EVOUTA_PIN            (PIN_PA7)
#define WAZAMONO_EVOUTA_ALT            (1)
#define WAZAMONO_EVOUTD_PIN            (PIN_PD2)
#define WAZAMONO_EVOUTD_ALT            (0)
#define WAZAMONO_EVOUTF_PIN            (PIN_PF2)
#define WAZAMONO_EVOUTF_ALT            (0)

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ---- */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

#define analogInputToDigitalPin(p)        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p) <= NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN))
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port) == PC ? PIN_PC3 : ((port) == PD ? PIN_PD0 : ((port) == PF ? PIN_PF0 : NOT_A_PIN))))

/* ---- PWM ----
 * millis lives on TCB0 (boards.txt -DMILLIS_USE_TIMERB0), leaving TCB1 free for
 * D3 PWM and for tone(). D3 (PA6) is not a TCB WO pin: it is LUT0's alternate
 * output, and analogWrite(D3) delivers TCB1's 8-bit PWM waveform through LUT0
 * (see the WAZAMONO_TCB1_LUTPWM_* block below and cores/dxcore/wazamono_lutpwm.h).
 * tone(): Tone.cpp routes tone to TCB1 whenever millis is on TCB0, so tone shares
 * TCB1 with D3 PWM - calling tone() suspends D3 PWM only, while D11 PWM on TCA0
 * keeps running (cf. Uno R3 Timer2 = D3+D11).
 * TCA0 -> PORTD: WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D6,D5,D9,D10,D11,D12. */
#if defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (0)                   /* TCB1 is millis; no TCB PWM */
#elif defined(MILLIS_USE_TIMERB0)
  /* TCB0 = millis -> TCB1 free. ONE waveform, THREE selectable outlets:
   * D3 (LUT0 alt), D4 (LUT1 default), D8 (TCB1 WO, ALT1). Exclusive - the
   * last analogWrite() among the three owns the route; default outlet D3. */
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PA6 || (p) == PIN_PC3 || (p) == PIN_PF5)
#else
  #define digitalPinHasPWMTCB(p) ((p) == PIN_PA6 || (p) == PIN_PC3 || (p) == PIN_PF5)
#endif
#define digitalPinHasPWMTCA(p) ( \
    (p) == PIN_PD0 || (p) == PIN_PD1 || (p) == PIN_PD2 || \
    (p) == PIN_PD3 || (p) == PIN_PD4 || (p) == PIN_PD5 )

