ws-asahi/UkiUkiCore/megaavr/variants/WazamonoTsurugi/pins_arduino.h
/* Direct ADC channel identifiers (ADC_CH() sets the 0x80 "this is a channel" flag). */
#define AIN0   ADC_CH(0)
#define AIN1   ADC_CH(1)
#define AIN2   ADC_CH(2)
#define AIN3   ADC_CH(3)
#define AIN4   ADC_CH(4)
#define AIN5   ADC_CH(5)
#define AIN6   ADC_CH(6)
#define AIN7   ADC_CH(7)
#define AIN16  ADC_CH(16)
#define AIN17  ADC_CH(17)
#define AIN18  ADC_CH(18)
#define AIN19  ADC_CH(19)
#define AIN20  ADC_CH(20)
#define AIN21  ADC_CH(21)
#define AIN22  ADC_CH(22)
#define AIN23  ADC_CH(23)
#define AIN24  ADC_CH(24)
#define AIN25  ADC_CH(25)
#define AIN26  ADC_CH(26)
#define AIN27  ADC_CH(27)
#define AIN31  ADC_CH(31)

/* ---- Pin arrays (ARDUINO_MAIN). Indexed by digital pin number (0..24). ---- */
#ifdef ARDUINO_MAIN
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA5  D0  RX/USART0 RX
    PA,         //  1 PA4  D1  TX/USART0 TX
    PA,         //  2 PA7  D2  USART0 XDIR / AC0 OUT / EVOUTA
    PA,         //  3 PA6  D3  TCB1 PWM via CCL LUT0
    PC,         //  4 PC3  D4  TCB1 PWM via CCL LUT1
    PD,         //  5 PD0  D5  TCA0 WO0
    PD,         //  6 PD1  D6  TCA0 WO1
    PF,         //  7 PF4  D7
    PF,         //  8 PF5  D8
    PD,         //  9 PD2  D9  TCA0 WO2
    PD,         // 10 PD3  D10 TCA0 WO3 / SS
    PD,         // 11 PD4  D11 TCA0 WO4 / MOSI
    PD,         // 12 PD5  D12 TCA0 WO5 / MISO
    PD,         // 13 PD6  D13 SCK / LED_BUILTIN
    PF,         // 14 PF0  A0
    PF,         // 15 PF1  A1
    PF,         // 16 PF2  A2
    PF,         // 17 PF3  A3
    PA,         // 18 PA2  A4 / SDA
    PA,         // 19 PA3  A5 / SCL
    PD,         // 20 PD7  AREF (VREFA)
    NOT_A_PORT, // 21 (hidden gap)
    NOT_A_PORT, // 22 (hidden gap)
    NOT_A_PORT, // 23 (hidden gap)
    NOT_A_PORT, // 24 (hidden gap)
    NOT_A_PORT, // 25 (hidden gap)
    NOT_A_PORT, // 26 (hidden gap)
    NOT_A_PORT, // 27 (hidden gap)
    NOT_A_PORT, // 28 (hidden gap)
    NOT_A_PORT, // 29 (hidden gap)
    PA,         // 30 PA0  D30 TX LED
    PA,         // 31 PA1  D31 RX LED
    PF,         // 32 PF6  RESET
    PF          // 33 PF7  UPDI
  };

  const uint8_t digital_pin_to_bit_position[] = {
    PIN5_bp,   //  0 PA5  D0
    PIN4_bp,   //  1 PA4  D1
    PIN7_bp,   //  2 PA7  D2
    PIN6_bp,   //  3 PA6  D3
    PIN3_bp,   //  4 PC3  D4
    PIN0_bp,   //  5 PD0  D5
    PIN1_bp,   //  6 PD1  D6
    PIN4_bp,   //  7 PF4  D7
    PIN5_bp,   //  8 PF5  D8
    PIN2_bp,   //  9 PD2  D9
    PIN3_bp,   // 10 PD3  D10
    PIN4_bp,   // 11 PD4  D11
    PIN5_bp,   // 12 PD5  D12
    PIN6_bp,   // 13 PD6  D13
    PIN0_bp,   // 14 PF0  A0
    PIN1_bp,   // 15 PF1  A1
    PIN2_bp,   // 16 PF2  A2
    PIN3_bp,   // 17 PF3  A3
    PIN2_bp,   // 18 PA2  A4
    PIN3_bp,   // 19 PA3  A5
    PIN7_bp,   // 20 PD7  D20/AREF
    NOT_A_PIN, // 21 (hidden gap)
    NOT_A_PIN, // 22 (hidden gap)
    NOT_A_PIN, // 23 (hidden gap)
    NOT_A_PIN, // 24 (hidden gap)
    NOT_A_PIN, // 25 (hidden gap)
    NOT_A_PIN, // 26 (hidden gap)
    NOT_A_PIN, // 27 (hidden gap)
    NOT_A_PIN, // 28 (hidden gap)
    NOT_A_PIN, // 29 (hidden gap)
    PIN0_bp,   // 30 PA0  D30 TX LED
    PIN1_bp,   // 31 PA1  D31 RX LED
    PIN6_bp,   // 32 PF6 RESET
    PIN7_bp    // 33 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = {
    PIN5_bm,   //  0 PA5  D0
    PIN4_bm,   //  1 PA4  D1
    PIN7_bm,   //  2 PA7  D2
    PIN6_bm,   //  3 PA6  D3
    PIN3_bm,   //  4 PC3  D4
    PIN0_bm,   //  5 PD0  D5
    PIN1_bm,   //  6 PD1  D6
    PIN4_bm,   //  7 PF4  D7
    PIN5_bm,   //  8 PF5  D8
    PIN2_bm,   //  9 PD2  D9
    PIN3_bm,   // 10 PD3  D10
    PIN4_bm,   // 11 PD4  D11
    PIN5_bm,   // 12 PD5  D12
    PIN6_bm,   // 13 PD6  D13
    PIN0_bm,   // 14 PF0  A0
    PIN1_bm,   // 15 PF1  A1
    PIN2_bm,   // 16 PF2  A2
    PIN3_bm,   // 17 PF3  A3
    PIN2_bm,   // 18 PA2  A4
    PIN3_bm,   // 19 PA3  A5
    PIN7_bm,   // 20 PD7  D20/AREF
    NOT_A_PIN, // 21 (hidden gap)
    NOT_A_PIN, // 22 (hidden gap)
    NOT_A_PIN, // 23 (hidden gap)
    NOT_A_PIN, // 24 (hidden gap)
    NOT_A_PIN, // 25 (hidden gap)
    NOT_A_PIN, // 26 (hidden gap)
    NOT_A_PIN, // 27 (hidden gap)
    NOT_A_PIN, // 28 (hidden gap)
    NOT_A_PIN, // 29 (hidden gap)
    PIN0_bm,   // 30 PA0  D30 TX LED
    PIN1_bm,   // 31 PA1  D31 RX LED
    PIN6_bm,   // 32 PF6 RESET
    PIN7_bm    // 33 PF7 UPDI
  };

  /* TCA0 PWM is resolved dynamically from PORTMUX, so TCA0 pins are NOT_ON_TIMER
   * here. D3 (PA6) is marked TIMERB1: it carries TCB1's PWM through CCL LUT0
   * (see WAZAMONO_TCB1_LUTPWM_* above). millis = TCB0. */
  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA5  D0
    NOT_ON_TIMER, //  1 PA4  D1
    NOT_ON_TIMER, //  2 PA7  D2
    TIMERB1,      //  3 PA6  D3  (TCB1 PWM via CCL LUT0 - default outlet)
    TIMERB1,      //  4 PC3  D4  (TCB1 PWM via CCL LUT1 - exclusive with D3/D8)
    NOT_ON_TIMER, //  5 PD0  D5  (TCA0 WO0, dynamic)
    NOT_ON_TIMER, //  6 PD1  D6  (TCA0 WO1, dynamic)
    NOT_ON_TIMER, //  7 PF4  D7  (no PWM: TCB0 = millis)
    TIMERB1,      //  8 PF5  D8  (TCB1 WO direct - exclusive with D3/D4)
    NOT_ON_TIMER, //  9 PD2  D9  (TCA0 WO2, dynamic)
    NOT_ON_TIMER, // 10 PD3  D10 (TCA0 WO3, dynamic)
    NOT_ON_TIMER, // 11 PD4  D11 (TCA0 WO4, dynamic)
    NOT_ON_TIMER, // 12 PD5  D12 (TCA0 WO5, dynamic)
    NOT_ON_TIMER, // 13 PD6  D13
    NOT_ON_TIMER, // 14 PF0  A0
    NOT_ON_TIMER, // 15 PF1  A1
    NOT_ON_TIMER, // 16 PF2  A2
    NOT_ON_TIMER, // 17 PF3  A3
    NOT_ON_TIMER, // 18 PA2  A4
    NOT_ON_TIMER, // 19 PA3  A5
    NOT_ON_TIMER, // 20 PD7  D20/AREF
    NOT_ON_TIMER, // 21 (hidden gap)
    NOT_ON_TIMER, // 22 (hidden gap)
    NOT_ON_TIMER, // 23 (hidden gap)
    NOT_ON_TIMER, // 24 (hidden gap)
    NOT_ON_TIMER, // 25 (hidden gap)
    NOT_ON_TIMER, // 26 (hidden gap)
    NOT_ON_TIMER, // 27 (hidden gap)
    NOT_ON_TIMER, // 28 (hidden gap)
    NOT_ON_TIMER, // 29 (hidden gap)
    NOT_ON_TIMER, // 30 PA0  D30 TX LED
    NOT_ON_TIMER, // 31 PA1  D31 RX LED
    NOT_ON_TIMER, // 32 PF6 RESET
    NOT_ON_TIMER  // 33 PF7 UPDI
  };
#endif

